Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་གང་ཞེ་ན། ནང་གཟུགས་སུ་འདུ་ཤེས་ཤིང་། ཕྱི་རོལ་གྱི་གཟུགས་ཕྲ་མོ་དང་། ཁ་དོག་སྡུག་གུ་དང་། ཁ་དོག་མི་སྡུག་པ་མཐོང་ཡང་གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས། ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་།
en: If you ask what are the eight sense fields of mastery, they are as follows: The first sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner forms regards subtle external forms, along with pleasant colors and unpleasant colors, but understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: དེ་ལྟར་འདུ་ཤེས་པ་དེ་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དང་པོའོ། །ནང་གཟུགས་སུ་འདུ་ཤེས་ཤིང་ཕྱི་རོལ་གྱི་གཟུགས་རགས་པ་དང་། ཁ་དོག་སྡུག་པ་དང་། ཁ་དོག་མི་སྡུག་པ་མཐོང་ཡང་། གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས། ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་། དེ་ལྟར་འདུ་ཤེས་པ་དེ་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་གཉིས་པའོ།
en: The second sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner forms regards gross external forms, along with pleasant colors and unpleasant colors, but understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་ཤིང་ཕྱི་རོལ་གྱི་གཟུགས་ཕྲ་མོ་དང་། ཁ་དོག་སྡུག་གུ་དང་། ཁ་དོག་མི་སྡུག་པ་མཐོང་ཡང་། གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས་ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་། འདུ་ཤེས་པ་དེ་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་གསུམ་པའོ། །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་ཤིང་། ཕྱི་རོལ་གྱི་གཟུགས་རགས་པ་དང་།
en: The third sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards subtle external forms, pleasant colors, and unpleasant colors, but understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: ཁ་དོག་སྡུག་པ་དང་། ཁ་དོག་མི་སྡུག་པ་མཐོང་ཡང་། གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས་ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་། དེ་ལྟར་འདུ་ཤེས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བཞི་པའོ། །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་ཤིང་ཕྱི་རོལ་གྱི་གཟུགས་སྔོན་པོ། ཁ་དོག་སྔོན་པོ་སྔོན་པོར་སྣང་བ། མདོག་སྔོན་པོ་འདི་ལྟ་སྟེ་དཔེར་ན་མེ་ཏོག་ཨོ་མ་ཀ་ལྟ་བུ་འམ། ཡུལ་བཱ་རཱ་ཎ་སཱིར་བྱས་པའི་གོས་ལྟར་སྔོ་བ།
en: The fourth sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards gross external forms, pleasant colors, and unpleasant colors, but understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: ཁ་དོག་སྔོ་བ་སྔོ་བར་སྣང་བ། མདོག་སྔོ་བར་མཐོང་ཡང་། གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས། ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་དེ་ལྟར་འདུ་ཤེས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་ལྔ་པའོ། །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་ཤིང་། ཕྱི་རོལ་གྱི་གཟུགས་སེར་པོ། ཁ་དོག་སེར་པོ། སེར་པོར་སྣང་བ། མདོག་སེར་པོ་འདི་ལྟ་སྟེ་དཔེར་ན། ཤིང་ཀར་ཤི་ཀ་རའི་མེ་ཏོག་ལྟ་བུ་འམ། ཡུལ་བཱ་རཱ་ཎ་སཱིར་བྱས་པའི་གོས་ལྟར་སེར་བ། ཁ་དོག་སེར་བ། སེར་བར་སྣང་བ། མདོག་སེར་བར་མཐོང་ཡང་། གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས།
en: The fifth sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards blue external forms, blue colors, and blue reflections—blue hues that are as blue, for example, as the flax blossom or [blue] cloth made in Vārāṇasī—but understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་། དེ་ལྟར་འདུ་ཤེས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དྲུག་པའོ། །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་ཤིང་། ཕྱི་རོལ་གྱི་གཟུགས་དམར་པོ། ཁ་དོག་དམར་པོ།
en: The sixth sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards yellow external forms, yellow colors, and yellow reflections—yellow hues that are as yellow, for example, as the cassia flower or [yellow] cloth made in Vārāṇasī—but understands these forms, having attained mastery over them, and sees them, having attained mastery over them. {

source: དམར་པོར་སྣང་བ། མདོག་དམར་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་བན་དུ་ཛི་བ་ཀའི་མེ་ཏོག་ལྟ་བུ་འམ། ཡུལ་བཱ་རཱ་ཎ་སཱིར་བྱས་པའི་གོས་ལྟར་དམར་བ། ཁ་དོག་དམར་བ།
en: Ki.

source: དམར་བར་སྣང་བ་མདོག་དམར་བར་མཐོང་ཡང་། གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས། ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་། དེ་ལྟར་འདུ་ཤེས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བདུན་པའོ། །ནང་གཟུགས་མེད་པར་འདུ་ཤེས་ཤིང་ཕྱི་རོལ་གྱི་གཟུགས་དཀར་པོ། ཁ་དོག་དཀར་པོ། དཀར་པོར་སྣང་བ། མདོག་དཀར་པོ། འདི་ལྟ་སྟེ་དཔེར་ན། སྐར་མ་པ་བ་སངས་ཀྱི་འོད་ལྟ་བུ་འམ། ཡུལ་བཱ་རཱ་ཎ་སཱིར་བྱས་པའི་གོས་ལྟར་དཀར་བ།
en: VIII: 59} The seventh sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards red external forms, red colors, and red reflections—red hues that are as red, for example, as the pentapetes flower or [red] cloth made in Vārāṇasī—but understands these forms, having attained mastery over them, and sees them, having attained mastery over them.

source: ཁ་དོག་དཀར་བ། དཀར་བར་སྣང་བ། མདོག་དཀར་བར་མཐོང་ཡང་གཟུགས་དེ་དག་ཟིལ་གྱིས་མནན་ཏེ་ཤེས། ཟིལ་གྱིས་མནན་ཏེ་མཐོང་ཞིང་། དེ་ལྟར་འདུ་ཤེས་པ་འདི་ནི་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་པའོ།
en: The eighth sense field of mastery refers to the [miraculous] perceptual transformation that ensues when one who perceives inner formlessness regards white external forms, white colors, and white reflections—white hues that are as white, for example, as the lights of the [morning] star Venus or [white] cloth made in Vārāṇasī— but understands these forms, having attained mastery over them, and sees them, having attained mastery over them. “

source: །དེ་ལ་ཉོན་མོངས་པ་མེད་པ་གང་ཞེ་ན། བསམ་གཏན་ལ་གནས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པར་སྤྱོད་པ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་ཉོན་མོངས་པ་མི་སྐྱེ་བའི་མཐུ་ཡོད་པ།
en: If you ask what is seclusion devoid of afflicted mental states, this refers to the conduct of bodhisattva great beings, abiding in meditative concentration, who achieve through that meditative stability the power to ensure that the afflicted mental states of other beings and other individuals do not arise.

source: ཏིང་ངེ་འཛིན་གང་གིས་འགྲུབ་པ་དེ་ནི་ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱའོ།
en: That is called seclusion devoid of afflicted mental states. “

source: །སྨོན་ལམ་གྱི་ཤེས་པ་གང་ཞེ་ན། བསམ་གཏན་ལ་གནས་ཏེ། འདི་ཤེས་པར་བྱའོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དུས་གསུམ་གྱི་ཤེས་པ་འམ། ཤེས་པ་གང་དང་གང་འདོད་པར་གྱུར་པ་དེ་ལ་ཡིད་ཀྱིས་སྨོན་པ་བྱེད་དེ།
en: If you ask what is knowledge based on aspiration, this refers to the knowledge of the three times that bodhisattva great beings acquire or the knowledge that they want when, abiding in meditative concentration, they mentally aspire that ‘this should be known.’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས། དེའི་སྨོན་ལམ་དེ་ཡོངས་སུ་གྲུབ་པར་གྱུར་ཅིང་། ཤེས་བྱ་དེ་ཡང་ཤེས་པ་དེ་ནི།
en: Arising from that meditative stability, they then consummate their aspirations and indeed understand that [specific] knowledge.

source: སྨོན་ལམ་གྱི་ཤེས་པ་ཞེས་བྱའོ།
en: This is called knowledge based on aspiration. “

source: །དེ་ལ་མངོན་པར་ཤེས་པ་དྲུག་གང་ཞེ་ན། རྫུ་འཕྲུལ་གྱི་མངོན་པར་ཤེས་པ་དང་། ལྷའི་མིག་གི་མངོན་པར་ཤེས་པ་དང་། ལྷའི་རྣ་བའི་མངོན་པར་ཤེས་པ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་མངོན་པར་ཤེས་པ་དང་།
en: If you ask what are the six extrasensory powers, they comprise the extrasensory power of miraculous abilities, the extrasensory power of divine clairvoyance, the extrasensory power of divine clairaudience, the extrasensory power of knowing the minds of others, the extrasensory power of recollecting past lives, and the extrasensory power of knowing that contaminants have ceased.

source: ཟག་པ་ཟད་པ་ཤེས་པའི་མངོན་པར་ཤེས་པ་སྟེ། དྲུག་པོ་དེ་དག་གོ །
en: These are called the six [extrasensory powers]. “

source: དེ་ལ་ཡོངས་སུ་དག་པ་བཞི་གང་ཞེ་ན། ལུས་ཡོངས་སུ་དག་པ་དང་། དམིགས་པ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཡོངས་སུ་དག་པ་དང་། ཡེ་ཤེས་ཡོངས་སུ་དག་པ་སྟེ།
en: If you ask what are the four utter purities, they comprise the utter purity of the physical body, the utter purity of objective referents, the utter purity of mind, and the utter purity of wisdom.

source: བཞི་པོ་དེ་དག་གོ །
en: These are called the four [utter purities]. “

source: དེ་ལ་དབང་བཅུ་གང་ཞེ་ན། ཚེ་ལ་དབང་བ་དང་། སེམས་ལ་དབང་བ་དང་། ཡོ་བྱད་ལ་དབང་བ་དང་། ལས་ལ་དབང་བ་དང་། སྐྱེ་བ་ལ་དབང་བ་དང་།
en: If you ask what are the ten controls, they comprise control over the lifespan, control over mind, control over resources, control over actions, control over birth, control over resolve, control over aspiration, control over miraculous abilities, control over wisdom, and control over phenomena.

source: མོས་པ་ལ་དབང་བ་དང་། སྨོན་ལམ་ལ་དབང་བ་དང་། རྫུ་འཕྲུལ་ལ་དབང་བ་དང་། ཡེ་ཤེས་ལ་དབང་བ་དང་།
en: These are called the ten [controls]. “

source: ཆོས་ལ་དབང་བ་སྟེ། བཅུ་པོ་དེ་དག་གོ། །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པའི་གནས་ལ་ཡང་གནས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, if you ask what constitute the ten powers of the tathāgatas, in this regard, Subhūti, they are as follows: (1) The tathāgatas definitively know that phenomena that are possible are indeed possible.

source: །གནས་མ་ཡིན་པ་ལ་ཡང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They definitively know that phenomena that are impossible are indeed impossible. (

source: །འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་དང་། ལས་ཡོངས་སུ་བླངས་པའི་རྣམ་པར་སྨིན་པ་གནས་ཀྱི་རྣམ་པ་དང་། རྒྱུའི་རྣམ་པར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: 2) They definitively know through contingencies and causes the maturation of the past, future, and present actions [of beings], and of those who undertake such actions. {

source: །ཁམས་སྣ་ཚོགས་ཅན་དང་།
en: Ki.

source: ཁམས་དུ་མ་ཅན་གྱི་འཇིག་རྟེན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: VIII: 60} (3) They definitively know various realms and their multiple constituents. (

source: །སེམས་ཅན་གཞན་དང་གང་ཟག་གཞན་གྱི་མོས་པ་སྣ་ཚོགས་དང་། མོས་པ་དུ་མ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །སེམས་ཅན་གཞན་དང་།
en: 4) They definitively know the diverse volitions and multiple volitions of other beings and other individuals. (

source: གང་ཟག་གཞན་གྱི་དབང་པོ་རབ་དང་ཐ་མ་ཤེས་པར་བྱ་བ་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: 5) They definitively know whether the acumen of other beings and other individuals is superior or inferior. (

source: །ཀུན་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །དབང་པོ་དང་།
en: 6) They definitively know the paths that lead anywhere. (

source: སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: 7) They definitively know [with respect to other beings and other individuals] the faculties, powers, branches of enlightenment, meditative concentrations, aspects of liberation, meditative stabilities, formless absorptions, and defiled or purified mental states that they have established. (

source: སྙོམས་པར་འཇུག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་རྣམ་པར་དགོད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: 8) They definitively know with pure divine clairvoyance, surpassing the sight of human beings, [all the circumstances of] beings—they perceive their deaths and rebirths, how they proceed to blissful realms and inferior realms, with pleasant or unpleasant complexions, positive or negative attributes, and how they proceed in accordance with their past actions. (

source: །རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དགོངས་ཏེ། ཚེ་རབས་གཅིག་ཀྱང་རྗེས་སུ་དགོངས་པ་ནས། ཚེ་རབས་བརྒྱ་དང་། ཚེ་རབས་སྟོང་དང་། ཚེ་རབས་བརྒྱ་སྟོང་དང་།
en: 9) They can recollect former lives in their many facets, recollecting a single past life, and from that recollecting anything up to a hundred past lives, a thousand past lives, a hundred thousand past lives, or even a hundred billion trillion past lives.

source: ཚེ་རབས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བར་དུ་ཡང་རྗེས་སུ་དགོངས་སོ། །བསྐལ་པ་གཅིག་ཀྱང་རྗེས་སུ་དགོངས་པ་ནས། བསྐལ་པ་བརྒྱའི་བར་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་།
en: Recollecting even an eon, they can also recollect up to a hundred eons, many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and even many hundred billion trillions of eons.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་བར་དག་ཀྱང་རྗེས་སུ་དགོངས་ཏེ།
en: They can recollect and make statements about aspects of many former lives, along with their whereabouts and circumstances, saying, ‘I was such [an individual].

source: བདག་ནི་འདི་ལྟ་བུ་ཞིག་ན་འདུག་འདུག་གོ །མིང་ནི་འདི་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: My name was this.

source: །རིགས་ནི་འདི་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: My family was this.

source: །རུས་ནི་འདི་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: My clan was this.

source: །ཟས་ནི་འདི་ཟ་ཟའོ།
en: This was the food I ate.

source: །ཡུན་ནི་འདི་སྲིད་ཅིག་ཏུ་གནས་གནས་སོ།
en: This was the duration I lived.

source: །ཚེའི་མཐའ་ནི་འདི་ཙམ་ཞིག་ཏུ་གྱུར་ཏེ།
en: The limits of my lifespan were of that extent.’

source: བདག་དེ་ནས་ཤི་འཕོས་ནས། ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ་ཞེས་བྱ་བ་ནས། དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་འདིར་སྐྱེས་སོ་ཞེས་བྱ་བའི་བར་དུ། རྣམ་པ་དང་བཅས། ས་མལ་དང་བཅས། གཏན་ཚིགས་དང་བཅས་པར་རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དགོངས་སོ། །ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། སེམས་ཅན་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དག་ཀྱང་གཟིགས་སོ། །ཁ་དོག་སྡུག་པ་དང་མི་སྡུག་པ་དང་། བཟང་བ་དང་། ངན་པ་དང་། བདེ་འགྲོ་ན་འཁོད་པ་དང་། ངན་སོང་ན་འཁོད་པ་དང་།
en: And, ‘After I died and transmigrated, I was born as so-and-so, and then after dying and transmigrating I have been born here.’ (

source: ལས་ཇི་ལྟ་བ་བཞིན་དུ་ཉེ་བར་འདོང་བའི་སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏེ།
en: 10) They definitively know the liberation of mind, the liberation of wisdom, and the state that is free from contaminants because all contaminants have ceased.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། ངག་གི་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱི་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ། ལོག་པར་ལྟ་བ་དག་སྟེ། དེའི་རྒྱུ་དེའི་རྐྱེན་གྱིས་ལུས་ཞིག་ནས། ངན་སོང་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བར་སྐྱེའོ། །སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: As such they know that these beings conduct themselves physically in negative ways, these conduct themselves verbally in negative ways, these conduct themselves mentally in negative ways, these deprecate the noble ones, these hold wrong views, and for such reasons once their body has perished they will fall into negative, inferior realms and be reborn in the hells.

source: ངག་གི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་འཕགས་པ་ལ་སྐུར་པ་མི་འདེབས་པ། ཡང་དག་པའི་ལྟ་བ་དག་སྟེ། དེའི་རྒྱུ་དེའི་རྐྱེན་གྱིས་ལུས་ཞིག་ནས། བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ལྷའི་ནང་དུ་སྐྱེའོ། །ཞེས་བྱ་བར་རབ་ཏུ་མཁྱེན་ཏོ། །ཟག་པ་རྣམས་ཟད་པའི་ཕྱིར། སེམས་རྣམ་པར་གྲོལ་བ་དང་། ཤེས་རབ་རྣམ་པར་གྲོལ་བ་དང་ཟག་པ་མེད་པའི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ།
en: These beings, on the other hand, conduct themselves physically in positive ways, these conduct themselves verbally in positive ways, these conduct themselves mentally in positive ways, these do not deprecate the noble ones, these hold genuine views, and for such reasons, once their body has perished, they will proceed to the blissful exalted realms and be reborn among the gods.

source: བཅུ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་སོ།
en: These ten are the powers of the tathāgatas. “

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་གང་ཞེ་ན། བདག་གིས་ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་སོ་ཞེས་དམ་བཅས་ན། འདི་ལ་ཆོས་འདིས་མངོན་པར་སངས་མ་རྒྱས་སོ་ཞེས་བྱ་བར་བདག་ལ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། ཚངས་པ་འམ། སྐྱེ་དགུའི་ཚོགས་གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ། །ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Subhūti, if you ask what constitute the four fearlessnesses [claimed by] the tathāgatas, they are as follows: (1) When I claim to have attained completely awakened buddhahood, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or any other creature should say that I have not attained consummate buddhahood with respect to these [particular] dharmas here, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: རྒྱུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས། བདག་བདེ་བ་ཐོབ་པ་དང་།
en: By correctly disregarding that reason, I have found ease and dwell in it.

source: ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷའམ་བདུད་དམ་ཚངས་པ་འམ་གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ། བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ། །བདག་ཟག་པ་ཟད་དོ་ཞེས་དམ་བཅས་ན། དེ་ལ་ཟག་པ་འདི་རྣམས་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཏོ། །ཞེས་བྱ་བར་བདག་ལ་དགེ་སྦྱོང་ངམ།
en: I will turn the wheel of Brahmā that has not previously been turned in the world, in conformity with the Dharma, by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else! (

source: བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ་ཚངས་པ་འམ། སྐྱེ་དགུའི་ཚོགས་གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ། །ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: 2) “When I claim I am one whose contaminants have ceased, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or any other creature should say that these [particular] contaminants [of mine] have not ceased, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ་ལྷ་འམ་བདུད་དམ་ཚངས་པ་འམ། གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མ་ནུས་པ་བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ།
en: I will turn the wheel of Brahmā which has not previously been turned in the world, in conformity with the Dharma, by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else! (

source: །གང་ཡང་བདག་གིས་བར་ཆད་ཀྱི་ཆོས་སུ་བསྟན་པ་དེ་དག་ལ་བསྟེན་ན་བར་ཆད་ཀྱི་ཆོས་སུ་མི་འགྱུར་ཞེས་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷའམ། བདུད་དམ། ཚངས་པ་འམ། སྐྱེ་དགུའི་ཚོགས་གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ། །ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: 3) “When I claim to have explained those phenomena that cause obstacles [on the spiritual path], if some virtuous ascetic, brāhmin, god, demon, Brahmā, or any other creature should insist that even though one might depend on those phenomena, there will be no obstacles, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: རྒྱུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས། དེ་ལ་བདག་ལ་བདེ་བ་ཐོབ་པ་དང་།
en: By correctly disregarding that reason, I have found ease and dwell in it.

source: བག་ཚ་བ་མེད་པ་ཐོབ་པ་དང་། མི་འཇིགས་པ་ཐོབ་པས་རྣམ་པར་སྤྱོད་དེ།
en: To have attained this absence of trepidation is to have attained fearlessness.

source: ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ་བདུད་དམ་ཚངས་པ་འམ། གཞན་སུས་ཀྱང་རུང་སྟེ་ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ་བདག་གིས་ཡང་དག་པར་བསྐོར་བར་བྱའོ།
en: I will turn the wheel of Brahmā which has not previously been turned in the world, in conformity with the Dharma, by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else! (

source: །གང་ཡང་བདག་གིས་ལམ་འཕགས་པའི་འབྱུང་བ་རྟོགས་པར་འགྱུར་བ་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བར་བསྟན་པ་དེ་དག་ལ་ནན་ཏན་བྱས་ན། སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བར་མི་འབྱུང་ངོ་ཞེས་དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་འམ་ལྷ་འམ་བདུད་དམ་ཚངས་པ་འམ། སྐྱེ་དགུའི་ཚོགས་གཞན་སུ་ཡང་རུང་སྟེ། འཇིག་རྟེན་ན་ཆོས་དང་ལྡན་པར་རྒོལ་བར་འགྱུར་རོ། །ཞེས་བྱ་བའི་རྒྱུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: 4) “When I claim to have shown the path that leads to realizing the emancipation of the noble and that will genuinely bring an end to suffering for those who make use of it, if some virtuous ascetic, brāhmin, god, demon, Brahmā, or any other creature should say that even if one emphasizes this [path], suffering will not cease, I would correctly disregard that reason for contradicting me, based on their worldly doctrines.

source: །འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་བསྒྲག་གོ།
en: I will rightly roar the lion’s roar in the midst of the assembly!

source: །ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ་ལྷ་འམ་བདུད་དམ་ཚངས་པ་འམ། གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ་བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ་ཞེས་བྱ་བ་སྟེ།
en: I will turn the wheel of Brahmā which has not previously been turned in the world, in conformity with the Dharma, by any virtuous ascetic, brāhmin, god, demon, Brahmā, or anyone else!

source: བཞི་པོ་དེ་དག་ནི་མི་འཇིགས་པའོ།
en: These four are called the fearlessnesses. “

source: །དེ་བཞིན་གཤེགས་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་སྟེ།
en: If you ask what constitute the four kinds of exact knowledge of the tathāgatas, they comprise exact knowledge of meanings, exact knowledge of dharmas, exact knowledge of their language and lexical explanations, and exact knowledge of their eloquent expression.

source: དེ་དག་ཀྱང་གང་ཞེ་ན། དོན་ལ་དམིགས་པ་དང་། ཆོས་ལ་དམིགས་པ་དང་། ངེས་པའི་ཚིགས་ལ་དམིགས་པ་དང་།
en: If you ask what these entail, they respectively refer to meanings, to dharmas, to language and lexical explanations, and to eloquent expression. “

source: སྤོབས་པ་ལ་དམིགས་པའོ། །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་བསྲུང་བ་མེད་པ་གསུམ་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ནི་སྐུའི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་སྐུའི་སྤྱོད་པ་ཡོངས་སུ་མ་དག་པ་མི་མངའ་བས། ལ་ལས་ཤེས་སུ་འོང་ངོ་ཞེས་གང་ཡང་བཅབ་པར་དགོངས་པ་དེ་བཞིན་གཤེགས་པ་ལ་མི་མངའ་སྟེ།
en: Subhūti, if you ask what constitute the three unguarded states of the tathāgatas, the tathāgatas are endowed with pure conduct of body, and since they do not act impurely with their bodies, the tathāgatas have no wish to stop anyone who comes to find out if this is so.

source: འདི་ནི་བསྲུང་བ་མེད་པ་དང་པོའོ།
en: That is the first unguarded state.

source: །དེ་བཞིན་གཤེགས་པ་ནི་གསུང་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་གསུང་གི་སྤྱོད་པ་ཡོངས་སུ་མ་དག་པ་མི་མངའ་བས། ལ་ལས་ཤེས་སུ་འོང་ངོ་ཞེས་གང་ཡང་བཅབ་པར་དགོངས་པ་དེ་བཞིན་གཤེགས་པ་ལ་མི་མངའ་སྟེ།
en: The tathāgatas are endowed with pure conduct of speech, and since they are without impure conduct of speech, the tathāgatas have no wish to stop anyone who comes to find out if this is so.

source: འདི་ནི་བསྲུང་བ་མེད་པ་གཉིས་པའོ།
en: That is the second unguarded state.

source: །དེ་བཞིན་གཤེགས་པ་ནི་ཐུགས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་ཐུགས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་མ་དག་པ་མི་མངའ་བས། ལ་ལས་ཤེས་སུ་འོང་ངོ་ཞེས་གང་ཡང་བཅབ་པར་དགོངས་པ་དེ་བཞིན་གཤེགས་པ་ལ་མི་མངའ་སྟེ།
en: The tathāgatas are endowed with pure conduct of mind, and since they are without impure conduct of mind, the tathāgatas have no wish to stop anyone who comes to find out if this is so.

source: འདི་ནི་བསྲུང་བ་མེད་པ་གསུམ་པའོ།
en: That is the third unguarded state. “

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་དགོངས་པ་ཉེ་བར་གཞག་པ་གསུམ་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པའི་ཚེ། ལ་ལ་རྣ་བ་བཏུད་དེ་རིམ་གྲོར་ཉན་ཅིང་། བཀའ་མཉན་པའི་སེམས་ཉེ་བར་གཞོག་པ་དང་། ཆོས་དང་གཉེར་བའི་ཆོས་ལ་ནན་ཏན་ཏུ་བྱེད་ན་ཡང་། དེས་དེ་བཞིན་གཤེགས་པ་དགྱེས་པར་མི་འགྱུར། ཡིད་བདེ་བར་མི་འགྱུར།
en: If you ask, in that regard, what are the three consolidations of the tathāgatas’ attitude, when the tathāgatas teach the Dharma, even when there are some who listen attentively with their ears cocked, focusing their minds on paying attention, and emphasizing care for the Dharma, the tathāgatas will not be delighted, comforted, or distracted by that.

source: ཐུགས་ཡེང་ཡེང་པོར་ཡང་མི་འགྱུར་ཏེ། འདི་ནི་དགོངས་པ་ཉེ་བར་གཞག་པ་དང་པོའོ།
en: This is the first consolidation of their attitude.

source: །ལ་ལ་རྣ་བ་བཏུད་ཏེ་རིམ་གྲོར་ཉན་ཅིང་བཀའ་མཉན་པའི་སེམས་ཉེ་བར་གཞོག་པ་མེད་པ་དང་། ཆོས་དང་གཉེར་བའི་ཆོས་ལ་ནན་ཏན་དུ་མི་བྱེད་ན། དེས་དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཁྲོ་བར་མི་འགྱུར། མི་བཟོད་པར་མི་འགྱུར་ཐུགས་མི་ཆེས་པར་མི་འགྱུར་ཏེ།
en: Even when there are some who do not listen attentively with their ears cocked, focus their minds on paying attention, or emphasize care for the Dharma, the tathāgatas will not be angered by that, they will not become intolerant, and they will not lose confidence.

source: འདི་ནི་དགོངས་པ་ཉེ་བར་གཞག་པ་གཉིས་པའོ། །ལ་ལ་རྣ་བ་བཏུད་དེ་རིམ་གྲོར་ཉན་ཅིང་བཀའ་མཉན་པའི་སེམས་ཉེ་བར་གཞོག་ལ།
en: This is the second consolidation of their attitude.
